Catalogs/ВидыДокументовБИА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовБИА</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСвязи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормыПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПечатнойФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыДокументовБИА/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторСвязи) Тогда
		ТекущийОбъект.ИдентификаторСвязи = Справочники.ВидыДокументовБИА.ИдентификаторСвязи(ТекущийОбъект.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Если ИсточникВыбора.ИмяФормы = "Справочник.ВариантыОтчетов.Форма.ФормаСписка"
			И ЗначениеЗаполнено(ВыбранноеЗначение) И ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			
			ДобавитьВариантыОтчетаНаСервере(ВыбранноеЗначение);
			
		ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ИдентификаторыОбъектовМетаданных.Форма.ФормаСписка" Тогда
			
			КомандыПечати = СформироватьКомандыПечати(ВыбранноеЗначение);
			Если КомандыПечати.Количество()>0 Тогда
				
				ПечатныеФормы = Новый СписокЗначений;
				Для Каждого КомандаПечати Из КомандыПечати Цикл
					ИдентификаторПечатнойФормы = КомандаПечати.Идентификатор;
					Если СтрРазделить(ИдентификаторПечатнойФормы, ",").Количество() = 1 Тогда
						ПечатныеФормы.Добавить(КомандаПечати, КомандаПечати.Представление);
					КонецЕсли;
				КонецЦикла;
				
				ПечатныеФормы.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыбратьПечатнуюФормуЗавершение", ЭтотОбъект, ВыбранноеЗначение), НСтр("ru = 'Выберите печатную форму'"));
			КонецЕсли;
			
		Иначе
			ПоказатьПредупреждение(,СтрШаблон(НСтр("ru='Для объекта %1 команды печати не обнаружены'"), ВыбранноеЗначение));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторСвязи) Тогда
		Объект.ИдентификаторСвязи = ИдентификаторСвязи(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ДобавитьВариантОтчета(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.ВариантыОтчетов.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПечатнуюФорму(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	Форма = ОткрытьФорму("Справочник.ИдентификаторыОбъектовМетаданных.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	ОтборПолноеИмя =Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПолноеИмя.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПолноеИмя.Использование = Истина;
	ОтборПолноеИмя.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборПолноеИмя.ПравоеЗначение = ИменаИнтегрируемыхОбъектовБИА();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРегламентированныйОтчет(Команда)
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПродолжитьДобавлениеРегламентированногоОтчета", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	Форма = ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораВидаОтчета", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИдентификаторСвязи(Наименование)
	Возврат Справочники.ВидыДокументовБИА.ИдентификаторСвязи(Наименование);
КонецФункции

&НаСервере
Процедура ДобавитьВариантыОтчетаНаСервере(ВыбранныеВариантыОтчетов)
	Для Каждого ВариантОтчета Из ВыбранныеВариантыОтчетов Цикл
		Если ТипЗнч(ВариантОтчета) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
			Если ТипЗнч(ВариантОтчета.Отчет) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных")
				ИЛИ ТипЗнч(ВариантОтчета.Отчет) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
				СвойстваПечатнойФормы = Новый Структура;
				СвойстваПечатнойФормы.Вставить("Представление", ВариантОтчета.Наименование);
				СвойстваПечатнойФормы.Вставить("ИдентификаторПечатнойФормы", ВариантОтчета.КлючВарианта);
				СвойстваПечатнойФормы.Вставить("ИдентификаторОбъектаМетаданных", ВариантОтчета.Отчет);
				ДобавитьПечатнуюФормуНаСервере(СвойстваПечатнойФормы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПечатнуюФормуНаСервере(СвойстваПечатнойФормы)
	Если ЗначениеЗаполнено(СвойстваПечатнойФормы.Представление) 
		И ЗначениеЗаполнено(СвойстваПечатнойФормы.ИдентификаторОбъектаМетаданных) 
		И ЗначениеЗаполнено(СвойстваПечатнойФормы.ИдентификаторПечатнойФормы) Тогда
		НоваяСтрока = Объект.ПечатныеФормы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СвойстваПечатнойФормы);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПечатнуюФормуЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		СвойстваПечатнойФормы = Новый Структура;
		СвойстваПечатнойФормы.Вставить("Представление", ВыбранныйЭлемент.Значение.Представление);
		СвойстваПечатнойФормы.Вставить("ИдентификаторПечатнойФормы", ВыбранныйЭлемент.Значение.Идентификатор);
		СвойстваПечатнойФормы.Вставить("ИдентификаторОбъектаМетаданных", ДополнительныеПараметры);
		ДобавитьПечатнуюФормуНаСервере(СвойстваПечатнойФормы);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьКомандыПечати(ВыбранноеЗначение)
	
	КомандыПечати = Новый ТаблицаЗначений;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ВыбранноеЗначение.ПолноеИмя);
	ПрефиксВнешнихПечатныхФорм = "ВнешняяПечатнаяФорма.";
	
	Если УправлениеПечатью.НастройкиПечатиОбъекта(МенеджерОбъекта).ПриДобавленииКомандПечати Тогда
		
		КомандыПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати();
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки") Тогда
			МодульДополнительныеОтчетыИОбработки = ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
			МодульДополнительныеОтчетыИОбработки.ПриПолученииКомандПечати(КомандыПечати, ВыбранноеЗначение.ПолноеИмя);
			Для Каждого КомандаПечати Из КомандыПечати Цикл
				ВнешняяПечатнаяФорма = Неопределено;
				Если КомандаПечати.ДополнительныеПараметры.Свойство("Ссылка", ВнешняяПечатнаяФорма) И ЗначениеЗаполнено(ВнешняяПечатнаяФорма) Тогда
					КомандаПечати.МенеджерПечати = СтрШаблон("%1%2", ПрефиксВнешнихПечатныхФорм, ВнешняяПечатнаяФорма.ИмяОбъекта);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		МенеджерОбъекта.ДобавитьКомандыПечати(КомандыПечати);
		
		КомандыПечати = КомандыПечати.Скопировать(,"Идентификатор, МенеджерПечати, Представление");
		
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(КомандыПечати);
КонецФункции

&НаСервере
Функция ИменаИнтегрируемыхОбъектовБИА()
	
	Результат = Новый Массив;
	Для Каждого ТипОбъекта Из Метаданные.ОпределяемыеТипы.СсылкаНаИнтегрируемыйОбъектБИА.Тип.Типы() Цикл
		
		Если ТипОбъекта = Тип("СправочникСсылка.Сотрудники") И Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип.СодержитТип(ТипОбъекта) 
			И Не ТипОбъекта = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
			СсылкаНаОбъект = Новый(ТипОбъекта);
			ИдентификаторОбъектаМетаданных = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", СсылкаНаОбъект.Метаданные().ПолноеИмя());
			Если ЗначениеЗаполнено(ИдентификаторОбъектаМетаданных) Тогда
				Результат.Добавить(ИдентификаторОбъектаМетаданных);
				Если ЗначениеЗаполнено(ИдентификаторОбъектаМетаданных.Родитель) Тогда
					Результат.Добавить(ИдентификаторОбъектаМетаданных.Родитель);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьДобавлениеРегламентированногоОтчета(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		Если ТипЗнч(РезультатЗакрытия.Ссылка) = Тип("СправочникСсылка.РегламентированныеОтчеты") Тогда
			СвойстваПечатнойФормы = Новый Структура;
			СвойстваПечатнойФормы.Вставить("Представление", РезультатЗакрытия.Наименование);
			СвойстваПечатнойФормы.Вставить("ИдентификаторПечатнойФормы", РезультатЗакрытия.ИсточникОтчета);
			СвойстваПечатнойФормы.Вставить("ИдентификаторОбъектаМетаданных", ИнтеграцияС1САрхивомВызовСервера.ИдентификаторРегламентированногоОтчета(РезультатЗакрытия.ИсточникОтчета));
			ДобавитьПечатнуюФормуНаСервере(СвойстваПечатнойФормы);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
